luxe/luxe-backend/app/controllers/locations_controller.rb

    def index
        locations = Location.all
---
SELECT "locations".* FROM "locations"

    def show
        location = Location.all.find_by(id: params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]