luxe/luxe-backend/app/controllers/session_controller.rb

    def create

        user = User.find_by(username: params["username"],password: params["password"])
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1 AND "users"."username" = $2 AND "users"."password" = $3 LIMIT $4  [["name", "j"], ["username", "m"], ["password", "a"], ["LIMIT", 1]]