luxe/luxe-backend/app/controllers/ships_controller.rb

    def index
        ships = Ship.all
---
SELECT "ships".* FROM "ships"

    def show
        ship = Ship.all.find_by(id: params[:id])
---
SELECT "ships".* FROM "ships" WHERE "ships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]