luxe/luxe-backend/app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
    def index
        trips = Trip.all

INSERT INTO "trips" ("username", "price", "ship_id", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "joe"], ["price", 1578], ["ship_id", 8], ["location_id", 2], ["created_at", "2020-03-12 19:28:15.587305"], ["updated_at", "2020-03-12 19:28:15.587305"]]
---
    def create

        trip = Trip.create(user_id: params["user_id"], price: params["price"],ship_id: params["ship_id"], location_id: params["location_id"])

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        trip = Trip.find_by(id: params[:id])