luxe/luxe-backend/app/controllers/users_controller.rb

    def create
        user = User.create(name: params["name"], username: params["username"],
        password: params["password"])
---
INSERT INTO "users" ("name", "username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "name"], ["username", "user"], ["password", "pass"], ["created_at", "2020-03-13 18:20:59.868206"], ["updated_at", "2020-03-13 18:20:59.868206"]]